app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" ORDER BY entries.updated_at DESC LIMIT 10
SELECT "tags".* FROM "tags"
---
  def index
    @entries = Entry.limit(10).last_updated.includes(:tags)

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
   @entry = Entry.find(params[:id])

INSERT INTO "entries" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Test"], ["created_at", Mon, 13 Feb 2012 19:52:31 UTC +00:00], ["title", "Test"], ["updated_at", Mon, 13 Feb 2012 19:52:31 UTC +00:00]]
---
  def create
    tag_list = params["entry"]["tags"]
    params["entry"].delete("tags")

    @entry = Entry.new(params["entry"])
    @entry.tag_list = tag_list
    respond_to do |format|
      if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy

SELECT "entries".* FROM "entries" ORDER BY entries.created_at DESC LIMIT 100
---
  def set_all_entries
     @all_entries = Entry.limit(100).by_date